{
  "_name_or_path": "nyu-visionx/siglip2_decoder",
  "architectures": ["ViTMAEForPreTraining"],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 1152,
  "decoder_intermediate_size": 4096,
  "decoder_num_attention_heads": 16,
  "decoder_num_hidden_layers": 28,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1152,
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-12,
  "model_type": "vit_mae",
  "norm_pix_loss": false,
  "num_channels": 3,
  "num_hidden_layers": 28,
  "patch_size": 14,
  "qkv_bias": true,
  "torch_dtype": "float32"
}
